tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F66K90_H_
#define _PIC18F66K90_H_

#define LCDCON                        0
#define LMUX0                         1
#define LMUX                          2
#define LMUX1                         3
#define LCDCON_CS                     4
#define CS0                           5
#define CS1                           6
#define WERR                          7
#define SLPEN                         8
#define LCDEN                         9
#define LCDPS                         10
#define LP                            11
#define LP0                           12
#define LP1                           13
#define LP2                           14
#define LP3                           15
#define WA                            16
#define LCDA                          17
#define BIASMD                        18
#define WFT                           19
#define LCDSE0                        20
#define SE00                          21
#define SE01                          22
#define SE02                          23
#define SE03                          24
#define SE04                          25
#define SE05                          26
#define SE06                          27
#define SE07                          28
#define LCDSE1                        29
#define SE08                          30
#define SE09                          31
#define SE10                          32
#define SE11                          33
#define SE12                          34
#define SE13                          35
#define SE14                          36
#define SE15                          37
#define LCDSE2                        38
#define SE16                          39
#define SE17                          40
#define SE18                          41
#define SE19                          42
#define SE20                          43
#define SE21                          44
#define SE22                          45
#define SE23                          46
#define LCDSE3                        47
#define SE24                          48
#define SE25                          49
#define SE26                          50
#define SE27                          51
#define SE28                          52
#define SE29                          53
#define SE30                          54
#define SE31                          55
#define LCDSE4                        56
#define SE32                          57
#define LCDRL                         58
#define LRLAT0                        59
#define LRLAT                         60
#define LRLAT1                        61
#define LRLAT2                        62
#define LCDIRI                        63
#define LRLBP                         64
#define LRLBP0                        65
#define LRLBP1                        66
#define LRLAP0                        67
#define LRLAP                         68
#define LRLAP1                        69
#define LCDREF                        70
#define VLCD1PE                       71
#define VLCD2PE                       72
#define VLCD3PE                       73
#define LCDCST0                       74
#define LCDCST                        75
#define LCDCST1                       76
#define LCDCST2                       77
#define LCDIRS                        78
#define LCDIRE                        79
#define SSP2CON2                      80
#define SEN2                          81
#define SSP2CON2_SEN                  82
#define ADMSK12                       83
#define SSP2CON2_RSEN                 84
#define RSEN2                         85
#define SSP2CON2_ADMSK1               86
#define ADMSK22                       87
#define PEN2                          88
#define SSP2CON2_PEN                  89
#define SSP2CON2_ADMSK2               90
#define ADMSK32                       91
#define SSP2CON2_RCEN                 92
#define RCEN2                         93
#define SSP2CON2_ADMSK3               94
#define ACKEN2                        95
#define ADMSK42                       96
#define SSP2CON2_ADMSK4               97
#define SSP2CON2_ACKEN                98
#define ACKDT2                        99
#define ADMSK52                       100
#define SSP2CON2_ACKDT                101
#define SSP2CON2_ADMSK5               102
#define SSP2CON2_ACKSTAT              103
#define ACKSTAT2                      104
#define SSP2CON2_GCEN                 105
#define GCEN2                         106
#define SSP2CON1                      107
#define SSP2CON1_SSPM                 108
#define SSP2CON1_SSPM0                109
#define SSPM02                        110
#define SSPM12                        111
#define SSP2CON1_SSPM1                112
#define SSP2CON1_SSPM2                113
#define SSPM22                        114
#define SSPM32                        115
#define SSP2CON1_SSPM3                116
#define SSP2CON1_CKP                  117
#define CKP2                          118
#define SSPEN2                        119
#define SSP2CON1_SSPEN                120
#define SSPOV2                        121
#define SSP2CON1_SSPOV                122
#define WCOL2                         123
#define SSP2CON1_WCOL                 124
#define SSP2STAT                      125
#define SSP2STAT_BF                   126
#define BF2                           127
#define SSP2STAT_UA                   128
#define UA2                           129
#define SSP2STAT_R_W                  130
#define SSP2STAT_I2C_READ             131
#define RW2                           132
#define SSP2STAT_R                    133
#define SSP2STAT_nW                   134
#define READ_WRITE2                   135
#define nW2                           136
#define SSP2STAT_nWRITE               137
#define I2C_READ2                     138
#define SSP2STAT_R_NOT_W              139
#define R_nW2                         140
#define SSP2STAT_READ_WRITE           141
#define nWRITE2                       142
#define R_W2                          143
#define SSP2STAT_R_nW                 144
#define SSP2STAT_NOT_WRITE            145
#define SSP2STAT_S                    146
#define S2                            147
#define START2                        148
#define SSP2STAT_I2C_START            149
#define I2C_START2                    150
#define P2                            151
#define SSP2STAT_I2C_STOP             152
#define SSP2STAT_P                    153
#define STOP2                         154
#define I2C_STOP2                     155
#define I2C_DAT2                      156
#define SSP2STAT_D                    157
#define DATA_ADDRESS2                 158
#define SSP2STAT_D_NOT_A              159
#define SSP2STAT_I2C_DAT              160
#define D_A2                          161
#define SSP2STAT_NOT_ADDRESS          162
#define SSP2STAT_D_nA                 163
#define SSP2STAT_DATA_ADDRESS         164
#define SSP2STAT_nADDRESS             165
#define nA2                           166
#define DA2                           167
#define nADDRESS2                     168
#define D_nA2                         169
#define SSP2STAT_nA                   170
#define SSP2STAT_D_A                  171
#define SSP2STAT_CKE                  172
#define CKE2                          173
#define SSP2STAT_SMP                  174
#define SMP2                          175
#define MSK02                         176
#define SSP2ADD                       177
#define SSP2ADD_MSK0                  178
#define MSK12                         179
#define SSP2ADD_MSK1                  180
#define MSK22                         181
#define SSP2ADD_MSK2                  182
#define MSK32                         183
#define SSP2ADD_MSK3                  184
#define MSK42                         185
#define SSP2ADD_MSK4                  186
#define MSK52                         187
#define SSP2ADD_MSK5                  188
#define MSK62                         189
#define SSP2ADD_MSK6                  190
#define MSK72                         191
#define SSP2ADD_MSK7                  192
#define SSP2BUF                       193
#define T4CON                         194
#define T4CKPS0                       195
#define T4CKPS                        196
#define T4CKPS1                       197
#define TMR4ON                        198
#define T4OUTPS                       199
#define T4OUTPS0                      200
#define T4OUTPS1                      201
#define T4OUTPS2                      202
#define T4OUTPS3                      203
#define PR4                           204
#define TMR4                          205
#define CCP7CON                       206
#define CCP7M0                        207
#define CCP7M                         208
#define CCP7M1                        209
#define CCP7M2                        210
#define CCP7M3                        211
#define DC7B                          212
#define CCP7Y                         213
#define DC7B0                         214
#define CCP7X                         215
#define DC7B1                         216
#define CCPR7L                        217
#define CCPR7H                        218
#define CCP6CON                       219
#define CCP6M                         220
#define CCP6M0                        221
#define CCP6M1                        222
#define CCP6M2                        223
#define CCP6M3                        224
#define CCP6Y                         225
#define DC6B0                         226
#define DC6B                          227
#define DC6B1                         228
#define CCP6X                         229
#define CCPR6L                        230
#define CCPR6H                        231
#define CCP5CON                       232
#define CCP5M0                        233
#define CCP5M                         234
#define CCP5M1                        235
#define CCP5M2                        236
#define CCP5M3                        237
#define CCP5Y                         238
#define DC5B0                         239
#define DC5B                          240
#define CCP5X                         241
#define DC5B1                         242
#define CCPR5L                        243
#define CCPR5H                        244
#define CCP4CON                       245
#define CCP4M                         246
#define CCP4M0                        247
#define CCP4M1                        248
#define CCP4M2                        249
#define CCP4M3                        250
#define CCP4Y                         251
#define DC4B0                         252
#define DC4B                          253
#define CCP4X                         254
#define DC4B1                         255
#define CCPR4L                        256
#define CCPR4H                        257
#define T5GCON                        258
#define T5GSS                         259
#define T5GSS0                        260
#define T5GSS1                        261
#define T5GVAL                        262
#define T5GGO_NOT_T5DONE              263
#define nT5DONE                       264
#define T5GGO_nT5DONE                 265
#define NOT_T5DONE                    266
#define T5GGO                         267
#define T5GSPM                        268
#define T5GTM                         269
#define T5GPOL                        270
#define TMR5GE                        271
#define T5CON                         272
#define TMR5ON                        273
#define T5CON_RD16                    274
#define RD165                         275
#define nT5SYNC                       276
#define NOT_T5SYNC                    277
#define SOSCEN5                       278
#define T5CON_SOSCEN                  279
#define T5CKPS                        280
#define T5CKPS0                       281
#define T5CKPS1                       282
#define TMR5CS0                       283
#define TMR5CS                        284
#define TMR5CS1                       285
#define TMR5L                         286
#define TMR5H                         287
#define PMD3                          288
#define TMR12MD                       289
#define CCP4MD                        290
#define CCP5MD                        291
#define CCP6MD                        292
#define CCP7MD                        293
#define CCP8MD                        294
#define CCP9MD                        295
#define CCP10MD                       296
#define PMD2                          297
#define CMP1MD                        298
#define CMP2MD                        299
#define CMP3MD                        300
#define TMR5MD                        301
#define TMR6MD                        302
#define TMR7MD                        303
#define TMR8MD                        304
#define TMR10MD                       305
#define PMD1                          306
#define TMR1MD                        307
#define TMR2MD                        308
#define TMR3MD                        309
#define TMR4MD                        310
#define RTCCMD                        311
#define CTMUMD                        312
#define PMD0                          313
#define ADCMD                         314
#define SSP1MD                        315
#define SPI1MD                        316
#define SPI2MD                        317
#define SSP2MD                        318
#define UART1MD                       319
#define UART2MD                       320
#define CCP1MD                        321
#define CCP2MD                        322
#define CCP3MD                        323
#define PSTR3CON                      324
#define PSTR3CON_STRA                 325
#define STRA3                         326
#define STRB3                         327
#define PSTR3CON_STRB                 328
#define PSTR3CON_STRC                 329
#define STRC3                         330
#define STRD3                         331
#define PSTR3CON_STRD                 332
#define STRSYNC3                      333
#define PSTR3CON_STRSYNC              334
#define PSTR3CON_CMPL0                335
#define CMPL03                        336
#define PSTR3CON_CMPL                 337
#define CMPL13                        338
#define PSTR3CON_CMPL1                339
#define PSTR2CON                      340
#define PSTR2CON_STRA                 341
#define P2DC02                        342
#define STRA2                         343
#define P2DC0CON                      344
#define STRB2                         345
#define P2DC12                        346
#define PSTR2CON_STRB                 347
#define P2DC1CON                      348
#define STRC2                         349
#define PSTR2CON_STRC                 350
#define P2DC22                        351
#define P2DC2CON                      352
#define P2DC32                        353
#define STRD2                         354
#define PSTR2CON_STRD                 355
#define P2DC3CON                      356
#define P2DC4CON                      357
#define STRSYNC2                      358
#define PSTR2CON_STRSYNC              359
#define P2DC42                        360
#define P2DC6CON                      361
#define PSTR2CON_CMPL                 362
#define CMPL02                        363
#define P2DC62                        364
#define PSTR2CON_CMPL0                365
#define CMPL12                        366
#define PSTR2CON_CMPL1                367
#define TXREG2                        368
#define RCREG2                        369
#define SPBRG2                        370
#define SPBRGH2                       371
#define BAUDCON2                      372
#define ABDEN2                        373
#define BAUDCON2_ABDEN                374
#define WUE2                          375
#define BAUDCON2_WUE                  376
#define BRG162                        377
#define BAUDCON2_BRG16                378
#define SCKP2                         379
#define TXCKP2                        380
#define BAUDCON2_TXCKP                381
#define DTRXP2                        382
#define RXDTP2                        383
#define BAUDCON2_RXDTP                384
#define RCMT2                         385
#define RCIDL2                        386
#define BAUDCON2_RCIDL                387
#define BAUDCON2_ABDOVF               388
#define ABDOVF2                       389
#define TXSTA2                        390
#define TX9D2                         391
#define TXSTA2_TX9D                   392
#define TXD82                         393
#define TRMT2                         394
#define TXSTA2_TRMT                   395
#define BRGH2                         396
#define TXSTA2_BRGH                   397
#define SENDB2                        398
#define TXSTA2_SENDB                  399
#define TXSTA2_SYNC                   400
#define SYNC2                         401
#define TXEN2                         402
#define TXSTA2_TXEN                   403
#define TX8_92                        404
#define TX92                          405
#define TXSTA2_TX9                    406
#define TXSTA2_CSRC                   407
#define CSRC2                         408
#define RCSTA2                        409
#define RCD82                         410
#define RX9D2                         411
#define RCSTA2_RX9D                   412
#define OERR2                         413
#define RCSTA2_OERR                   414
#define FERR2                         415
#define RCSTA2_FERR                   416
#define ADDEN2                        417
#define RCSTA2_ADDEN                  418
#define RCSTA2_CREN                   419
#define CREN2                         420
#define SREN2                         421
#define RCSTA2_SREN                   422
#define RC92                          423
#define RC8_92                        424
#define RCSTA2_RX9                    425
#define RX92                          426
#define RCSTA2_SPEN                   427
#define SPEN2                         428
#define ANCON2                        429
#define PCFG16                        430
#define ANSEL16                       431
#define PCFG17                        432
#define ANSEL17                       433
#define PCFG18                        434
#define ANSEL18                       435
#define PCFG19                        436
#define ANSEL19                       437
#define ANCON1                        438
#define ANSEL8                        439
#define PCFG8                         440
#define ANSEL9                        441
#define PCFG9                         442
#define PCFG10                        443
#define ANSEL10                       444
#define ANSEL11                       445
#define PCFG11                        446
#define ANCON0                        447
#define ANSEL0                        448
#define PCFG0                         449
#define ANSEL1                        450
#define PCFG1                         451
#define ANSEL2                        452
#define PCFG2                         453
#define ANSEL3                        454
#define PCFG3                         455
#define ANSEL4                        456
#define PCFG4                         457
#define ANSEL5                        458
#define PCFG5                         459
#define ANSEL6                        460
#define PCFG6                         461
#define ANSEL7                        462
#define PCFG7                         463
#define ODCON3                        464
#define CTMUDS                        465
#define U1OD                          466
#define U2OD                          467
#define ODCON2                        468
#define CCP3OD                        469
#define CCP4OD                        470
#define CCP5OD                        471
#define CCP6OD                        472
#define CCP7OD                        473
#define CCP8OD                        474
#define CCP9OD                        475
#define CCP10OD                       476
#define ODCON1                        477
#define SPI2OD                        478
#define CCP1OD                        479
#define CCP2OD                        480
#define SPI1OD                        481
#define REFOCON                       482
#define RODIV0                        483
#define RODIV                         484
#define RODIV1                        485
#define RODIV2                        486
#define RODIV3                        487
#define ROSEL                         488
#define ROSSLP                        489
#define ROON                          490
#define CCPTMRS2                      491
#define C8TSEL0                       492
#define C8TSEL                        493
#define C8TSEL1                       494
#define C9TSEL0                       495
#define C10TSEL0                      496
#define CCPTMRS1                      497
#define C4TSEL                        498
#define C4TSEL0                       499
#define C4TSEL1                       500
#define C5TSEL0                       501
#define C6TSEL0                       502
#define C7TSEL                        503
#define C7TSEL0                       504
#define C7TSEL1                       505
#define CCPTMRS0                      506
#define C1TSEL0                       507
#define C1TSEL                        508
#define C1TSEL1                       509
#define C1TSEL2                       510
#define C2TSEL0                       511
#define C2TSEL                        512
#define C2TSEL1                       513
#define C2TSEL2                       514
#define C3TSEL0                       515
#define C3TSEL                        516
#define C3TSEL1                       517
#define CM3CON                        518
#define CM3CON_CCH                    519
#define CCH03                         520
#define CM3CON_CCH0                   521
