tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k90_tdd.h
#define T1GVAL                        1649
#define T1GGO_nT1DONE                 1650
#define nT1DONE                       1651
#define T1GGO_NOT_T1DONE              1652
#define NOT_T1DONE                    1653
#define T1GGO                         1654
#define T1GSPM                        1655
#define T1GTM                         1656
#define T1GPOL                        1657
#define TMR1GE                        1658
#define RCSTA1                        1659
#define RCSTA1_RX9D                   1660
#define RX9D1                         1661
#define RCD8                          1662
#define RCSTA1_OERR                   1663
#define OERR1                         1664
#define RCSTA1_FERR                   1665
#define FERR1                         1666
#define RCSTA1_ADDEN                  1667
#define ADDEN1                        1668
#define ADEN                          1669
#define RCSTA1_CREN                   1670
#define CREN1                         1671
#define SRENA                         1672
#define SREN1                         1673
#define RCSTA1_SREN                   1674
#define RC8_9                         1675
#define RCSTA1_RX9                    1676
#define nRC8                          1677
#define NOT_RC8                       1678
#define RC9                           1679
#define RX91                          1680
#define RCSTA1_SPEN                   1681
#define SPEN1                         1682
#define TXSTA1                        1683
#define TX9D1                         1684
#define TXSTA1_TX9D                   1685
#define TXD8                          1686
#define TRMT1                         1687
#define TXSTA1_TRMT                   1688
#define BRGH1                         1689
#define TXSTA1_BRGH                   1690
#define TXSTA1_SENDB                  1691
#define SENDB1                        1692
#define TXSTA1_SYNC                   1693
#define SYNC1                         1694
#define TXEN1                         1695
#define TXSTA1_TXEN                   1696
#define TX91                          1697
#define TX8_9                         1698
#define NOT_TX8                       1699
#define nTX8                          1700
#define TXSTA1_TX9                    1701
#define TXSTA1_CSRC                   1702
#define CSRC1                         1703
#define TXREG1                        1704
#define RCREG1                        1705
#define SPBRG1                        1706
#define T3GCON                        1707
#define T3GSS0                        1708
#define T3GSS                         1709
#define T3GSS1                        1710
#define T3GVAL                        1711
#define T3GGO                         1712
#define NOT_T3DONE                    1713
#define nT3DONE                       1714
#define T3GGO_nT3DONE                 1715
#define T3GGO_NOT_T3DONE              1716
#define T3GSPM                        1717
#define T3GTM                         1718
#define T3GPOL                        1719
#define TMR3GE                        1720
#define T3CON                         1721
#define TMR3ON                        1722
#define T3CON_RD16                    1723
#define nT3SYNC                       1724
#define NOT_T3SYNC                    1725
#define SOSCEN3                       1726
#define T3CON_SOSCEN                  1727
#define T3CKPS0                       1728
#define T3CKPS                        1729
#define T3CKPS1                       1730
#define TMR3CS                        1731
#define TMR3CS0                       1732
#define TMR3CS1                       1733
#define T3RD16                        1734
#define RD163                         1735
#define TMR3L                         1736
#define TMR3H                         1737
#define CMSTAT                        1738
#define CMSTAT_C1OUT                  1739
#define CMP1OUT                       1740
#define CMSTAT_C2OUT                  1741
#define CMP2OUT                       1742
#define CMP3OUT                       1743
#define CMSTAT_C3OUT                  1744
#define CVRCON                        1745
#define CVR                           1746
#define CVR0                          1747
#define CVR1                          1748
#define CVR2                          1749
#define CVR3                          1750
#define CVR4                          1751
#define CVRR                          1752
#define CVRSS                         1753
#define CVROEN                        1754
#define CVROE                         1755
#define CVREN                         1756
#define PIE4                          1757
#define CCP3IE                        1758
#define CCP4IE                        1759
#define CCP5IE                        1760
#define CCP6IE                        1761
#define CCP7IE                        1762
#define CCP8IE                        1763
#define CCP9IE                        1764
#define CCP10IE                       1765
#define PIR4                          1766
#define CCP3IF                        1767
#define CCP4IF                        1768
#define CCP5IF                        1769
#define CCP6IF                        1770
#define CCP7IF                        1771
#define CCP8IF                        1772
#define CCP9IF                        1773
#define CCP10IF                       1774
#define IPR4                          1775
#define CCP3IP                        1776
#define CCIP3IP                       1777
#define CCP4IP                        1778
#define CCP5IP                        1779
#define CCP6IP                        1780
#define CCP7IP                        1781
#define CCP8IP                        1782
#define CCP9IP                        1783
#define CCP10IP                       1784
#define PIE5                          1785
#define TMR4IE                        1786
#define TMR5IE                        1787
#define TMR6IE                        1788
#define TMR7IE                        1789
#define TMR8IE                        1790
#define TMR10IE                       1791
#define TMR12IE                       1792
#define TMR7GIE                       1793
#define PIR5                          1794
#define TMR4IF                        1795
#define TMR5IF                        1796
#define TMR6IF                        1797
#define TMR7IF                        1798
#define TMR8IF                        1799
#define TMR10IF                       1800
#define TMR12IF                       1801
#define TMR7GIF                       1802
#define CCP1CON                       1803
#define CCP1M0                        1804
#define CCP1M                         1805
#define CCP1M1                        1806
#define CCP1M2                        1807
#define CCP1M3                        1808
#define CCP1Y                         1809
#define DC1B                          1810
#define DC1B0                         1811
#define CCP1X                         1812
#define DC1B1                         1813
#define P1M                           1814
#define P1M0                          1815
#define P1M1                          1816
#define CCPR1L                        1817
#define CCPR1H                        1818
#define ECCP1DEL                      1819
#define P1DC                          1820
#define P1DC0                         1821
#define P1DC1                         1822
#define P1DC2                         1823
#define P1DC3                         1824
#define P1DC4                         1825
#define P1DC5                         1826
#define P1DC6                         1827
#define P1RSEN                        1828
#define PSS1BD0                       1829
#define PSS1BD                        1830
#define PSS1BD1                       1831
#define PSS1AC                        1832
#define PSS1AC0                       1833
#define PSS1AC1                       1834
#define ECCP1AS                       1835
#define ECCP1AS0                      1836
#define ECCP1AS1                      1837
#define ECCP1AS2                      1838
#define ECCP1ASE                      1839
#define ADCON2                        1840
#define ADCS0                         1841
#define ADCS                          1842
#define ADCS1                         1843
#define ADCS2                         1844
#define ACQT0                         1845
#define ACQT                          1846
#define ACQT1                         1847
#define ACQT2                         1848
#define ADFM                          1849
#define ADCON1                        1850
#define CHSN0                         1851
#define CHSN                          1852
#define CHSN1                         1853
#define CHSN2                         1854
#define VNCFG                         1855
#define CHSN3                         1856
#define VCFG                          1857
#define VCFG01                        1858
#define VCFG0                         1859
#define VCFG11                        1860
#define VCFG1                         1861
#define TRIGSEL                       1862
#define TRIGSEL0                      1863
#define TRIGSEL1                      1864
#define ADCON0                        1865
#define ADON                          1866
#define nDONE                         1867
#define GO_nDONE                      1868
#define NOT_DONE                      1869
#define GODONE                        1870
#define GO_DONE                       1871
#define DONE                          1872
#define GO_NOT_DONE                   1873
#define GO                            1874
#define CHS0                          1875
#define CHS                           1876
#define CHS1                          1877
#define CHS2                          1878
#define CHS3                          1879
#define CHS4                          1880
#define ADRESL                        1881
#define ADRESH                        1882
#define SSP1CON2                      1883
#define SEN1                          1884
#define SSP1CON2_SEN                  1885
#define ADMSK11                       1886
#define SSP1CON2_RSEN                 1887
#define RSEN1                         1888
#define SSP1CON2_ADMSK1               1889
#define SSP1CON2_PEN                  1890
#define ADMSK21                       1891
#define PEN1                          1892
#define SSP1CON2_ADMSK2               1893
#define ADMSK31                       1894
#define RCEN1                         1895
#define SSP1CON2_RCEN                 1896
#define SSP1CON2_ADMSK3               1897
#define SSP1CON2_ACKEN                1898
#define ACKEN1                        1899
#define ADMSK41                       1900
#define SSP1CON2_ADMSK4               1901
#define ACKDT1                        1902
#define ADMSK51                       1903
#define SSP1CON2_ACKDT                1904
#define SSP1CON2_ADMSK5               1905
#define SSP1CON2_ACKSTAT              1906
#define ACKSTAT1                      1907
#define GCEN1                         1908
#define SSP1CON2_GCEN                 1909
#define SSP1CON1                      1910
#define SSP1CON1_SSPM0                1911
#define SSPM01                        1912
#define SSP1CON1_SSPM                 1913
#define SSP1CON1_SSPM1                1914
#define SSPM11                        1915
#define SSP1CON1_SSPM2                1916
#define SSPM21                        1917
#define SSPM31                        1918
#define SSP1CON1_SSPM3                1919
#define SSP1CON1_CKP                  1920
#define CKP1                          1921
#define SSPEN1                        1922
#define SSP1CON1_SSPEN                1923
#define SSPOV1                        1924
#define SSP1CON1_SSPOV                1925
#define WCOL1                         1926
#define SSP1CON1_WCOL                 1927
#define SSP1STAT                      1928
#define BF1                           1929
#define SSP1STAT_BF                   1930
#define UA1                           1931
#define SSP1STAT_UA                   1932
#define SSP1STAT_R_NOT_W              1933
#define RW1                           1934
#define NOT_W                         1935
#define SSP1STAT_R                    1936
#define SSP1STAT_nW                   1937
#define RW                            1938
#define SSP1STAT_READ_WRITE           1939
#define SSP1STAT_nWRITE               1940
#define SSP1STAT_I2C_READ             1941
#define SSP1STAT_R_W                  1942
#define SSP1STAT_NOT_WRITE            1943
#define SSP1STAT_R_nW                 1944
#define SSP1STAT_S                    1945
#define START                         1946
#define SSP1STAT_I2C_START            1947
#define START1                        1948
#define STOP                          1949
#define SSP1STAT_P                    1950
#define STOP1                         1951
#define SSP1STAT_I2C_STOP             1952
#define SSP1STAT_D                    1953
#define SSP1STAT_D_NOT_A              1954
#define NOT_A                         1955
#define SSP1STAT_D_A                  1956
#define SSP1STAT_D_nA                 1957
#define SSP1STAT_NOT_ADDRESS          1958
#define SSP1STAT_nA                   1959
#define DA1                           1960
#define DA                            1961
#define SSP1STAT_I2C_DAT              1962
#define SSP1STAT_nADDRESS             1963
#define SSP1STAT_DATA_ADDRESS         1964
#define SSP1STAT_CKE                  1965
#define CKE1                          1966
#define SSP1STAT_SMP                  1967
#define SMP1                          1968
#define SSP1ADD                       1969
#define SSP1ADD_MSK0                  1970
#define MSK01                         1971
#define SSPADD                        1972
#define SSP1ADD_MSK1                  1973
#define MSK11                         1974
#define SSP1ADD_MSK2                  1975
#define MSK21                         1976
#define MSK31                         1977
#define SSP1ADD_MSK3                  1978
#define SSP1ADD_MSK4                  1979
#define MSK41                         1980
#define MSK51                         1981
#define SSP1ADD_MSK5                  1982
#define MSK61                         1983
#define SSP1ADD_MSK6                  1984
#define SSP1ADD_MSK7                  1985
#define MSK71                         1986
#define SSP1BUF                       1987
#define SSPBUF                        1988
#define T2CON                         1989
#define T2CKPS0                       1990
#define T2CKPS                        1991
#define T2CKPS1                       1992
#define TMR2ON                        1993
#define T2OUTPS0                      1994
#define T2OUTPS                       1995
#define T2OUTPS1                      1996
#define T2OUTPS2                      1997
#define T2OUTPS3                      1998
#define WM0                           1999
#define PR2                           2000
#define WM1                           2001
#define WAIT0                         2002
#define WAIT1                         2003
#define EBDIS                         2004
#define TMR2                          2005
#define T1CON                         2006
#define TMR1ON                        2007
#define T1CON_RD16                    2008
#define NOT_T1SYNC                    2009
#define nT1SYNC                       2010
#define T1OSCEN                       2011
#define T1CON_SOSCEN                  2012
#define T1CKPS0                       2013
#define T1CKPS                        2014
#define T1CKPS1                       2015
#define TMR1CS0                       2016
#define TMR1CS                        2017
#define T1RD16                        2018
#define TMR1CS1                       2019
#define TMR1L                         2020
#define TMR1H                         2021
#define RCON                          2022
#define BOR                           2023
#define NOT_BOR                       2024
#define nBOR                          2025
#define POR                           2026
#define nPOR                          2027
#define NOT_POR                       2028
#define PD                            2029
#define nPD                           2030
#define NOT_PD                        2031
#define nTO                           2032
#define TO                            2033
#define NOT_TO                        2034
#define nRI                           2035
#define NOT_RI                        2036
#define RI                            2037
#define NOT_CM                        2038
#define CM                            2039
#define nCM                           2040
#define SBOREN                        2041
#define IPEN                          2042
#define WDTCON                        2043
#define SWDTEN                        2044
#define SWDTE                         2045
#define ULPSINK                       2046
#define ULPEN                         2047
#define SRETEN                        2048
#define ULPLVL                        2049
#define REGSLP                        2050
#define IPR5                          2051
#define CCH05                         2052
#define TMR4IP                        2053
#define CCH15                         2054
#define TMR5IP                        2055
#define TMR6IP                        2056
#define EVPOL05                       2057
#define TMR7IP                        2058
#define EVPOL15                       2059
#define TMR8IP                        2060
#define TMR10IP                       2061
#define TMR12IP                       2062
#define TMR7GIP                       2063
#define OSCCON                        2064
#define SCS0                          2065
#define SCS                           2066
#define SCS1                          2067
#define HFIOFS                        2068
#define OSTS                          2069
#define IRCF                          2070
#define IRCF0                         2071
#define IRCF1                         2072
#define IRCF2                         2073
#define IDLEN                         2074
#define SPBRGH1                       2075
#define T0CON                         2076
#define T0PS                          2077
#define T0PS0                         2078
#define T0PS1                         2079
#define T0PS2                         2080
#define PSA                           2081
#define T0SE                          2082
#define T0CS                          2083
#define T08BIT                        2084
#define TMR0ON                        2085
#define TMR0L                         2086
#define TMR0H                         2087
#define STATUS                        2088
#define C                             2089
#define CARRY                         2090
#define DC                            2091
#define ZERO                          2092
#define Z                             2093
#define OV                            2094
#define OVERFLOW                      2095
#define N                             2096
#define NEGATIVE                      2097
#define FSR2L                         2098
#define PLUSW2                        2099
#define PREINC2                       2100
#define POSTDEC2                      2101
#define POSTINC2                      2102
#define INDF2                         2103
#define FSR1L                         2104
#define PLUSW1                        2105
#define PREINC1                       2106
#define POSTDEC1                      2107
#define POSTINC1                      2108
#define INDF1                         2109
#define WREG                          2110
#define FSR0L                         2111
#define PLUSW0                        2112
#define PREINC0                       2113
#define POSTDEC0                      2114
#define POSTINC0                      2115
#define INDF0                         2116
#define INTCON3                       2117
#define INT1IF                        2118
#define INT1F                         2119
#define INT2IF                        2120
#define INT2F                         2121
#define INT3F                         2122
#define INT3IF                        2123
#define INT1E                         2124
#define INT1IE                        2125
#define INT2IE                        2126
#define INT2E                         2127
#define INT3E                         2128
#define INT3IE                        2129
#define INT1P                         2130
#define INT1IP                        2131
#define INT2IP                        2132
#define INT2P                         2133
#define INTCON2                       2134
#define RBIP                          2135
#define INT3IP                        2136
#define INT3P                         2137
#define TMR0IP                        2138
#define T0IP                          2139
#define INTEDG3                       2140
#define INTEDG2                       2141
#define INTEDG1                       2142
#define INTEDG0                       2143
#define RBPU                          2144
#define NOT_RBPU                      2145
#define nRBPU                         2146
#define INTCON                        2147
#define RBIF                          2148
#define INT0F                         2149
#define INT0IF                        2150
#define T0IF                          2151
#define TMR0IF                        2152
#define RBIE                          2153
#define INT0E                         2154
#define INT0IE                        2155
#define T0IE                          2156
#define TMR0IE                        2157
#define PEIE                          2158
#define PEIE_GIEL                     2159
#define GIEL                          2160
#define GIE_GIEH                      2161
#define GIE                           2162
#define GIEH                          2163
#define PRODL                         2164
#define PRODH                         2165
#define TABLAT                        2166
#define TBLPTRL                       2167
#define TBLPTRH                       2168
#define PCL                           2169
#define PCLATH                        2170
#define PCH                           2171
#define SP0                           2172
#define STKPTR                        2173
#define SP1                           2174
#define SP2                           2175
#define SP3                           2176
#define SP4                           2177
#define STKUNF                        2178
#define STKOVF                        2179
#define STKFUL                        2180
#define TOSL                          2181
#define TOSH                          2182

#endif // _PIC18F66K90_H_
